In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
obj = pd.Series([1,4,-3,5])

In [3]:
obj.array, obj.index

(<PandasArray>
 [1, 4, -3, 5]
 Length: 4, dtype: int64,
 RangeIndex(start=0, stop=4, step=1))

In [4]:
obj2 = pd.Series([4,6,-2,5], index=['d', 'a', 'c',' b'])
obj2, obj2.index, obj2.array

(d     4
 a     6
 c    -2
  b    5
 dtype: int64,
 Index(['d', 'a', 'c', ' b'], dtype='object'),
 <PandasArray>
 [4, 6, -2, 5]
 Length: 4, dtype: int64)

In [5]:
obj2["a"]
obj2["b"] = 80

In [6]:
obj2

d      4
a      6
c     -2
 b     5
b     80
dtype: int64

In [7]:
obj2[["a", "b", "c"]]

a     6
b    80
c    -2
dtype: int64

In [8]:
obj2[obj2 > 4]

a      6
 b     5
b     80
dtype: int64

In [9]:
np.exp(obj2)

d     5.459815e+01
a     4.034288e+02
c     1.353353e-01
 b    1.484132e+02
b     5.540622e+34
dtype: float64

In [10]:
"b" in obj2, "z" in obj2

(True, False)

In [11]:
sdata = { 'ktm': 1829, 'btl': 12423, 'brt': 192083, 'pokh': 90 }
obj3 = pd.Series(sdata)
obj3

ktm       1829
btl      12423
brt     192083
pokh        90
dtype: int64

In [12]:
obj3.to_dict()
obj3

ktm       1829
btl      12423
brt     192083
pokh        90
dtype: int64

In [13]:
states = ['pokh', 'ktm', 'btl', 'brt']
obj4 = pd.Series(sdata, index=states)

In [14]:
obj4

pokh        90
ktm       1829
btl      12423
brt     192083
dtype: int64

In [15]:
pd.isna(obj4)

pokh    False
ktm     False
btl     False
brt     False
dtype: bool

In [16]:
pd.notna(obj4)

pokh    True
ktm     True
btl     True
brt     True
dtype: bool

In [17]:
obj4.isna(), obj4.notna()

(pokh    False
 ktm     False
 btl     False
 brt     False
 dtype: bool,
 pokh    True
 ktm     True
 btl     True
 brt     True
 dtype: bool)

In [18]:
obj3

ktm       1829
btl      12423
brt     192083
pokh        90
dtype: int64

In [19]:
obj3 + obj4 #data is aligned by index label`

brt     384166
btl      24846
ktm       3658
pokh       180
dtype: int64

In [20]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
pokh        90
ktm       1829
btl      12423
brt     192083
Name: population, dtype: int64

In [21]:
obj

0    1
1    4
2   -3
3    5
dtype: int64

In [22]:
obj.index = ['bob', 'cheems', 'doge', 'sriganesh']
obj.index.name = 'First Name'

In [23]:
obj

First Name
bob          1
cheems       4
doge        -3
sriganesh    5
dtype: int64

In [24]:
# dataframes
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
 "year": [2000, 2001, 2002, 2001, 2002, 2003],
 "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [25]:
frame, frame.head(), frame.tail()

(    state  year  pop
 0    Ohio  2000  1.5
 1    Ohio  2001  1.7
 2    Ohio  2002  3.6
 3  Nevada  2001  2.4
 4  Nevada  2002  2.9
 5  Nevada  2003  3.2,
     state  year  pop
 0    Ohio  2000  1.5
 1    Ohio  2001  1.7
 2    Ohio  2002  3.6
 3  Nevada  2001  2.4
 4  Nevada  2002  2.9,
     state  year  pop
 1    Ohio  2001  1.7
 2    Ohio  2002  3.6
 3  Nevada  2001  2.4
 4  Nevada  2002  2.9
 5  Nevada  2003  3.2)

In [26]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [27]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [28]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [29]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [30]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [31]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [32]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [33]:
frame2["debt"] = 16.8

In [34]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.8
1  2001    Ohio  1.7  16.8
2  2002    Ohio  3.6  16.8
3  2001  Nevada  2.4  16.8
4  2002  Nevada  2.9  16.8
5  2003  Nevada  3.2  16.8

In [35]:
frame2['debt'] = np.arange(6.)

In [36]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [37]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])

In [38]:
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [39]:
frame2.debt

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
Name: debt, dtype: float64

In [40]:
frame2['debt'] = val

In [41]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [42]:
frame2["eastern"] = frame2["state"] == "Ohio"
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6   NaN     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9   NaN    False
5  2003  Nevada  3.2   NaN    False

In [43]:
del frame2["eastern"]

In [44]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [45]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
"Nevada": {2001: 2.4, 2002: 2.9}}

In [46]:
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [47]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [48]:
pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [49]:
pdata = {"Ohio": frame3["Ohio"][:-1],
 "Nevada": frame3["Nevada"][:2]}

In [50]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [51]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [52]:
frame3.index.name = "YEAR"
frame3.columns.name = "state"
frame3

state  Ohio  Nevada
YEAR
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [53]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [54]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [55]:
obj = pd.Series(np.arange(3), index=['a', 'b', 'c'])
index = obj.index

In [56]:
index = obj.index

In [57]:
index

Index(['a', 'b', 'c'], dtype='object')

In [58]:
index[1:]

Index(['b', 'c'], dtype='object')

In [59]:
index[1:]

Index(['b', 'c'], dtype='object')

In [60]:
index[2] = 'hemlo'

TypeError: Index does not support mutable operations

In [ ]:
labels = pd.Index(np.arange(3))
labels

In [ ]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [ ]:
obj2

In [ ]:
obj2.index is labels

In [ ]:
frame3

In [ ]:
frame3.columns

In [ ]:
"Ohio" in frame3.columns

In [ ]:
2003 in frame3.index

In [ ]:
pd.Index(['foo','foo','bar','bar'])

In [ ]:
obj2 = pd.Series([4.5, 7.2, -5.32, 5.4], index=['d', 'b', 'a', 'c'])

In [ ]:
obj2.reindex(['a', 'b', 'c'])

In [ ]:
obj2

In [ ]:
obj3 = pd.Series(['blue', 'purple', "yellow"], index=[0,2,4])
obj3

In [ ]:
obj3.reindex(np.arange(6), method="ffill")

In [ ]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                    index=['a', 'c', 'd'],
                    columns = ["Ohio","Texas", "California"])

In [ ]:
frame

In [ ]:
frame2 = frame.reindex(index=['a','b','c','d'])
frame2

In [ ]:
states = ["Texas", "Utah", "California"]
frame.reindex(columns=states)

In [ ]:
frame.reindex(states, axis="columns")

In [ ]:
frame.loc[['a', 'd', 'c'], ["California", "Texas"]]

In [ ]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c','d', 'e'])

In [ ]:
obj

In [ ]:
new_obj = obj.drop("c")

In [ ]:
new_obj

In [ ]:
obj.drop(["d", "c"])

In [ ]:
obj

In [ ]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
 index=["Ohio", "Colorado", "Utah", "New York"],
 columns=["one", "two", "three", "four"])

In [ ]:
data

In [ ]:
data.drop(index=["Colorado", "Ohio"])

In [ ]:
data.drop(columns=["two"])

In [ ]:
data.drop("two", axis=1)

In [ ]:
data.drop(["two", "four"], axis="columns")

In [ ]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [ ]:
obj

In [ ]:
obj["b"]

In [ ]:
obj[1], obj[2:4]

In [ ]:
obj[["b", "a", "d"]]

In [ ]:
obj[[1, 3]]

In [ ]:
obj[obj < 3]

In [ ]:
obj.loc[["b", 'a', 'd']]

In [ ]:
obj1 = pd.Series([1,2,3], index=[2,0,1])
obj2 = pd.Series([1,2,3], index=["a", "b", "c"])

In [ ]:
obj1, obj2

In [ ]:
obj1[[1,2]]

In [ ]:
obj2[[0, 2]]

In [ ]:
obj2.loc[[0, 1]]

In [61]:
obj2.iloc[[0,1,2]]

d    4
a    6
c   -2
dtype: int64

In [62]:
obj2.loc["b":"c"]

Series([], dtype: int64)

In [63]:
obj2.loc["b":"c"] = 5

In [64]:
obj2

d      4
a      6
c     -2
 b     5
b     80
dtype: int64

In [65]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
 index=["Ohio", "Colorado", "Utah", "New York"],
 columns=["one", "two", "three", "four"])

In [66]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [67]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [68]:
data[["three", "four"]]

          three  four
Ohio          2     3
Colorado      6     7
Utah         10    11
New York     14    15

In [69]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [70]:
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [71]:
data < 4

            one    two  three   four
Ohio       True   True   True   True
Colorado  False  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [72]:
data[data < 5] = 0

In [73]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [74]:
data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [75]:
data.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

In [76]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int64

In [77]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [78]:
data.iloc[[2, 1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [79]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [80]:
data.iloc[[1,2], [3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [81]:
data.loc[:"Utah", "two"]

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [82]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [83]:
data.loc[data.three >= 2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [84]:
ser = pd.Series(np.arange(3.))

In [88]:
ser, ser[0]

(0    0.0
 1    1.0
 2    2.0
 dtype: float64,
 0.0)

In [89]:
ser2 = pd.Series(np.arange(3.), index=["a", "b", "c"])

In [90]:
ser2[-1]

2.0

In [91]:
ser.iloc[-1]

2.0

In [92]:
ser[:2]

0    0.0
1    1.0
dtype: float64

In [93]:
data.loc[:, "one"] = 1

In [94]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [95]:
data.iloc[2] = 5

In [96]:
data.loc[data["four"] > 5] = 3

In [97]:
data.loc[data.three == 5, 'three'] = 6

In [98]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      6     5
New York    3    3      3     3

In [99]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
 index=["a", "c", "e", "f", "g"])

In [100]:
s1, s2

(a    7.3
 c   -2.5
 d    3.4
 e    1.5
 dtype: float64,
 a   -2.1
 c    3.6
 e   -1.5
 f    4.0
 g    3.1
 dtype: float64)

In [101]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [103]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"),
 index=["Ohio", "Texas", "Colorado"])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
 index=["Utah", "Ohio", "Texas", "Oregon"])

In [104]:
df1, df2

(            b    c    d
 Ohio      0.0  1.0  2.0
 Texas     3.0  4.0  5.0
 Colorado  6.0  7.0  8.0,
           b     d     e
 Utah    0.0   1.0   2.0
 Ohio    3.0   4.0   5.0
 Texas   6.0   7.0   8.0
 Oregon  9.0  10.0  11.0)

In [105]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [106]:
df1 = pd.DataFrame({"A": [1, 2]})
df2 = pd.DataFrame({"B": [3, 4]})

In [107]:
df1, df2

(   A
 0  1
 1  2,
    B
 0  3
 1  4)

In [ ]:
df1 + df2

In [108]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
columns=list("abcd"))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
 columns=list("abcde"))

In [109]:
df2.loc[1, 'b'] = np.nan

In [110]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [111]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [112]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [113]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [114]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [115]:
arr = np.arange(12.).reshape((3,4))

In [116]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [117]:
arr[0]

array([0., 1., 2., 3.])

In [118]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [119]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
 columns=list("bde"),
 index=["Utah", "Ohio", "Texas", "Oregon"])

In [120]:
series = frame.iloc[0]

In [121]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [122]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [123]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [124]:
series2 = pd.Series(np.arange(3), index=["b", "e", "f"])

In [125]:
series2

b    0
e    1
f    2
dtype: int64

In [126]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [127]:
series3 = frame["d"]

In [128]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [129]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [130]:
frame.sub(series3, axis="index")

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [131]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
 columns=list("bde"),
 index=["Utah", "Ohio", "Texas", "Oregon"])

In [132]:
frame

               b         d         e
Utah   -0.951171  0.006804  0.501083
Ohio   -1.286961  1.613184  1.525433
Texas   0.822626  0.692456  0.271896
Oregon -0.652316 -0.041427 -0.900259

In [133]:
np.abs(frame)

               b         d         e
Utah    0.951171  0.006804  0.501083
Ohio    1.286961  1.613184  1.525433
Texas   0.822626  0.692456  0.271896
Oregon  0.652316  0.041427  0.900259

In [134]:
def f1(x):
    return x.max() - x.min()

In [135]:
frame.apply(f1)

b    2.109587
d    1.654610
e    2.425692
dtype: float64

In [136]:
frame.apply(f1, axis="columns")

Utah      1.452254
Ohio      2.900144
Texas     0.550730
Oregon    0.858832
dtype: float64

In [137]:
def f2(x):
    return pd.Series([x.min(), x.max()], index=["min", "max"])

In [138]:
frame.apply(f2)

            b         d         e
min -1.286961 -0.041427 -0.900259
max  0.822626  1.613184  1.525433

In [140]:
def my_format(x):
    return f"{x:2f}"

In [141]:
frame.applymap(my_format)

                b          d          e
Utah    -0.951171   0.006804   0.501083
Ohio    -1.286961   1.613184   1.525433
Texas    0.822626   0.692456   0.271896
Oregon  -0.652316  -0.041427  -0.900259

In [142]:
frame["e"].map(my_formatmat)

Utah       0.501083
Ohio       1.525433
Texas      0.271896
Oregon    -0.900259
Name: e, dtype: object

In [143]:
obj = pd.Series(np.arange(4), index=["d", "a", "b", "c"])

In [144]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [145]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [146]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
 index=["three", "one"],
 columns=["d", "a", "b", "c"])

In [147]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [148]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [149]:
frame.sort_index(axis='columns')

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [150]:
frame.sort_index(axis="columns", ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [151]:
obj = pd.Series([4,7,-3,2])

In [152]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [153]:
obj.sort_values(na_position = "first")

2   -3
3    2
0    4
1    7
dtype: int64

In [154]:
frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [155]:
frame.sort_values("b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [156]:
frame.sort_values(["a", "b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [160]:
obj = pd.Series([7, -5, 7, 4, 2, 0 ,5])

In [161]:
obj.rank()
new_obj.rank()

0    6.5
1    1.0
2    6.5
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64